app/controllers/words_controller.rb

SELECT "words".* FROM "words" ORDER BY "words"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
---
  def index
    @words = Word.all

SELECT "words".* FROM "words" WHERE (name LIKE '%スタック%')
---
  def search
    if params[:q].present?
      @words = Word.where("name LIKE ?","%#{params[:q]}%")

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @word = Word.find(params[:id])

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @word = Word.find(params[:id])

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "words" SET "explanation" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["explanation", "後入れ先出し。"], ["updated_at", "2025-05-16 13:41:03.596230"], ["id", 1]]
---
  def update
    @word = Word.find(params[:id])
    if @word.update(word_params)

INSERT INTO "words" ("name", "explanation", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @word = Word.new(word_params)
    if @word.save