app/controllers/words_controller.rb

  def create
    @word = Word.new(word_params)
    if @word.save
---
INSERT INTO "words" ("name", "explanation", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "トランザクション"], ["explanation", "処理開始から処理終了までの一連の流れ"], ["count", nil], ["created_at", "2025-05-07 13:59:25.769458"], ["updated_at", "2025-05-07 13:59:25.769458"]]